##Решение для строки:
# Сохраним строку в переменной. 
str_1 = 'AaBbCcDd' 
# Выводим на экран требуемые строки. 
print('str_1[::2] ->', str_1[::2], end='\n\n') 
# Смещаем вывод на единицу. 
print('str_1[1::2]->', str_1[1::2]) 



##Стеком 

##Решение для списка:
# Сохраним список в переменной. 
li = ['a', '1', 'b', '2', 'c', '3'] 
# Получаем требуемые срезы. 
li_1 = li[0::2] 
li_2 = li[1::2] 
# Сам список удаляем. 
del li 
# Выводим полученные списки на экран. 
print(li_1, li_2, sep='\n\n')

## Стеком №2
stack =  
stack.append('a')  
stack.append('b')  
stack.append('c')  
print(stack)  
# Вывод: ['a', 'b', 'c']







